| 这个作业属于哪个课程        | <https://edu.cnblogs.com/campus/gdgy/CSGrade21-12?page=16>         |
| ----------------- | --------------- |
| ----------------- | --------------- |
|                   |                 |
| 这个作业要求在哪里         | <https://edu.cnblogs.com/campus/gdgy/CSGrade21-12/homework/13015>       |
|                   |                 |
| 这个作业的目标           | <熟练掌握Markdown语法，熟悉博客园操作以及GitHub基本操作>  |

**1.自我介绍**
大家好我叫艾山·依力哈木，叫我艾山就好，我来自我们新疆的东大门哈密瓜之乡哈密，维吾尔族，喜欢摄影，旅游，听音乐和探索世界！
2019年通过自身努力考到了广东工业大学，来到这里以后也结识了很多新的朋友，我们去了很多城市，深刻的体会到了南方城市的魅力。
2021年大一课程结束后我选择了休学创业，开了一家休闲零食店，或许开一家店并不能算得上创业但这只是我创业道路的开始，因为学业原因，2023年3月
我又回归到了校园生活，因为离开校园一年多的时间，很多课程对于我来说学起来还是挺吃力的，但是我也在努力跟上同学们的脚步，相信有一天会跟他们并肩前行

![](https://img2023.cnblogs.com/blog/3275546/202309/3275546-20230924191602461-2064510544.jpg)
![](https://img2023.cnblogs.com/blog/3275546/202309/3275546-20230924191704045-539088499.jpg)
![](https://img2023.cnblogs.com/blog/3275546/202309/3275546-20230924191809758-1532985532.jpg)

**2.软工五问**
问题1：什么是软件工程
软件工程是一门研究用工程化方法构建和维护有效、实用和高质量的软件的学科。它涉及程序设计语言、数据库、软件开发工具、系统平台、标准、设计件有电子邮件、嵌入式系统、人机界面、办公套件、操作系统、编译器、数据库、游戏等。同时，各个行业几乎都有计算机软件的应用，如工业、农业、银行、航空、政府部门等。这些应用促进了经济和社会的发展，也提高了工作效率和生活效率。

问题2：学习软件工程需要做什么

学习编程基础：软件工程的核心是编写代码，因此需要掌握一门或多门编程语言的基础，例如Java、C++、Python等。可以通过自学或参加编程课程来学习。
了解软件开发流程：软件开发过程包括需求分析、设计、编码、测试、部署等环节，需要掌握每个环节的流程和方法。
学习软件设计原则：软件设计需要遵循一些基本的原则，例如单一职责原则、开放封闭原则、接口隔离原则等。需要了解这些原则，并在实际编写代码时应用。
掌握软件工程工具：软件工程需要使用各种工具来辅助开发，例如版本控制工具、集成开发环境、测试工具等。需要学会使用这些工具。
参与实际项目：通过参与实际软件开发项目，可以学习到实践中的各种问题和解决方法，加深对软件工程的理解和掌握。
持续学习：软件工程是一个不断发展和演变的领域，需要不断学习新的技术和方法。可以通过参加培训、阅读相关书籍和论文等方式来保持学习态势。总之，学好软件工程需要不断探索和实践，需要有持续的学习和进步的心态。
问题3：软件工程的目标:
1、可修改性：允许对系统进行修改而不增加原系统的复杂性。它支持软件的调试和维护，是一个难以达到的目标。
2、可靠性：能防止因概念、设计和结构等方面的不完善造成的软件系统失效，具有挽回因操作不当造成软件系统失效的能力。
3、可理解性：系统具有清晰的结构，能直接反映问题的需求。可理解性有助于控制系统软件复杂性，并支持软件的维护、移植或重用。
4、可维护性：软件交付使用后，能够对它进行修改，以改正潜伏的错误，改进性能和其它属性，使软件产品适应环境的变化等。软件维护费
用在软件开发费用中占有很大的比重。可维护性是软件工程中一项十分重要的目标。
5、可重用性：把概念或功能相对独立的一个或一组相关模块定义为一个软部件。可组装在系统的任何位置，降低工作量。
6、可移植性：软件从一个计算机系统或环境搬到另一个计算机系统或环境的难易程度。
7、可追踪性：根据软件需求对软件设计、程序进行正向追踪，或根据软件设计、程序对软件需求的逆向追踪的能力。

问题4：软件开发需要具备什么样的能力？

一定编程能力

问题5：软件工程对软件开发有什么帮助

提高软件质量：软件工程可以通过规范化的流程和工具，确保软件项目的高质量交付。这不仅包括了软件功能的正确性和稳定性，还包括了软件的可维护性和可靠性。
提高开发效率：软件工程可以帮助软件开发团队规范化开发流程，减少开发过程中的重复劳动和错误。同时也可以提高代码复用性和可扩展性，减少开发时间和成本。
降低风险：软件工程可以通过规范化的项目管理流程，减少项目中的风险和不确定性。同时也可以通过严格的测试和验证，确保软件系统的稳定性和可靠性。
提高用户满意度：软件工程可以帮助软件开发团队更好地了解用户需求，从而开发出更加符合用户期望的软件产品。同时也可以通过用户反馈和持续改进，不断提高软件系统的用户体验和用户满意度。
**课程期待收获：**
·希望通过软件工程可以进一步锻炼我的工程思维，提高解决实际问题的能力。
·在学习这门课程的同时，可以完善并充沛我的知识体系，发现知识漏洞，不断查漏补缺

**Markdown后台博文编辑界面的截图**
![](https://img2023.cnblogs.com/blog/3275546/202309/3275546-20230924192458890-738588197.png)
